#+TITLE: Discrete Fourier Transform
#+DESCRIPTION: DFT in MATLAB/Octave
#+INCLUDE: "../web/config.org"

* Complex Conjugates
Just like points and vectors, complex numbers have a "length" or magnitude
 - ||a+ib|| = \radic(a^{2}+b^{2}}
#+BEGIN_SRC octave
abs(3+4i)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
5
#+END_SRC

And just like for points and vectors, this norm is a real scalar value

The square of the norm is ofcourse just /a^{2}+b^{2}/ and this often comes up in things like the inner product.  For instance given a vector [x y] we can take its inner product with itself [x y][x y]^{T} to get its norm-squared. In the trivial =1x1= case this will be [z][z]^{T} which is z^{2}.

In the complex case where /z/ is a complex number /a+ib/ then we'd get /z*z^{T}=z^{2}=(a+ib)^{2}=a^{2}+i2ab-b^{2}/ which is non-real and doesn't match our magnitude-squared. So using the transpose no longer works. But this norm-squared is still easy to express as a product
 - a^{2}+b^{2} = (a+ib)(a-ib)
With /a-ib/ known as the /complex conjugate/ of /a+ib/
#+BEGIN_SRC octave
conj(3+4j)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
3-4i
#+END_SRC

#+BEGIN_SRC octave
v = 3+4i
v*conj(v)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
25
#+END_SRC

And what's convenient is that this actually still works for real values. Since a real value /a/ can be written as the complex number a+i*0 we can write its complex conjugate as a-i*0 and see that it's norm is
 - a^2+0^2 = (a+i0)(a-i0) = a^2
Which is just the absolute value of /a/ squared
#+BEGIN_SRC octave
v = 3
v*conj(v)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
9
#+END_SRC

So instead of doing a transpose we need to introduce a new transposition called the Hermitian transpose
 - [a+ib c+id]^{*} = [a-ib c-d]^{T}
The Hermitian transpose is denoted with a star. It simply take a normal transpose and replaces the terms with their complex conjugates.
#+BEGIN_SRC octave
v = [3+4i 6+8i]
v'
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
| 3-4i |
| 6-8i |
#+END_SRC

#+BEGIN_SRC octave
v = [3+4i 6+8i]
v*v'
#+END_SRC

#+RESULTS:
: 125

 When the vector values are all real it will behave exactly like a transpose and when the values are complex, it will take their conjugates and give us scalar/real values of each complex values' magnitude

